#!/usr/bin/python3
# coding: utf-8

alert_map = {
    "信息搜集": {
        "101": "使用SAMR查询敏感用户组",
        "102": "使用SAMR查询敏感用户",
        "103": "PsLoggedOn信息收集",
        "104": "蜜罐账户的活动"
    },

    "凭证盗取": {
        "201": "Kerberoasting",
        "202": "AS-REP Roasting",
        "203": "远程Dump域控密码"
    },

    "横向移动": {
        "301": "账户爆破",
        "302": "显式凭据远程登录",
        "303": "目标域控的远程代码执行",
        "304": "未知文件共享名",
        "305": "Kerberos票据加密方式降级",
        "306": "异常的Kerberos票据请求"
    },

    "权限提升": {
        "401": "ACL异常修改",
        # "402": "伪造的账户信息",
        "403": "MS17-010攻击",
        "404": "新增组策略",
        "405": "NTLM中继活动",
        "406": "基于资源的约束委派权限授予",
        "407": "攻击打印机服务 SpoolSample",
        "408": "未知的特权登录",
        "409": "Kerberos约束委派滥用",
        "410": "MS14-068攻击"
    },

    "权限维持": {
        "501": "AdminSDHolder对象修改",
        "502": "DCShadow攻击",
        "503": "DSRM密码重置",
        "504": "组策略委派权限授予",
        "505": "Kerberos约束委派权限授予",
        "506": "敏感用户组修改",
        "507": "域控新增系统服务",
        "508": "域控新增计划任务",
        "509": "SIDHistory属性修改",
        "510": "万能钥匙-主动检测",
        "512": "万能钥匙-被动检测",
        "511": "黄金票据活动"
    },

    "防御绕过": {
        "601": "域控日志被清空",
        "602": "域控事件日志服务被关闭"
    }
}


def get_title_by_code(code: str) -> str:
    for label, part in alert_map.items():
        for _code, title in part.items():
            if code == _code:
                return title
    return ""
